# Week 3

### Topics:
1. Reading files
2. Describing datasets
3. Missing values imputation
4. MACHINE LEARNING

### Reading files

In [1]:
import pandas as pd

data = pd.read_csv("train.csv")
x = pd.read_csv("train.csv", header = None)

print(data.head(1))
print()
print(data.columns.tolist())
print()
print(data.iloc[10]["Name"])
print()
print(data[data["Age"]>=80])

   PassengerId  Survived  Pclass                     Name   Sex   Age  SibSp  \
0            1         0       3  Braund, Mr. Owen Harris  male  22.0      1

   Parch     Ticket  Fare Cabin Embarked
0      0  A/5 21171  7.25   NaN        S

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

Sandstrom, Miss. Marguerite Rut

     PassengerId  Survived  Pclass                                  Name  \
630          631         1       1  Barkworth, Mr. Algernon Henry Wilson

      Sex   Age  SibSp  Parch Ticket  Fare Cabin Embarked
630  male  80.0      0      0  27042  30.0   A23        S

### Describing datasets

In [2]:
data.describe().head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400

In [3]:
data.describe(include = ["O"])

                      Name   Sex  Ticket Cabin Embarked
count                  891   891     891   204      889
unique                 891     2     681   147        3
top     Lahoud, Mr. Sarkis  male  347082    G6        S
freq                     1   577       7     4      644

In [4]:
data.describe(exclude = ["O"]).tail(1)

     PassengerId  Survived  Pclass   Age  SibSp  Parch      Fare
max        891.0       1.0     3.0  80.0    8.0    6.0  512.3292

In [5]:
data.count().head(1)

PassengerId    891
dtype: int64

In [6]:
data[data.isnull().any(axis=1)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [7]:
good = data.notnull().sum(axis=1)==len(data.columns.tolist())

data.iloc[good.index[good]].T.head(2)

,1,3,6,10,11,21,23,27,52,54,...,835,853,857,862,867,871,872,879,887,889
PassengerId,2,4,7,11,12,22,24,28,53,55,...,836,854,858,863,868,872,873,880,888,890
Survived,1,1,0,1,1,1,1,0,1,0,...,1,1,1,1,0,1,0,1,1,1

### Missing values imputation

In [8]:
data.count().index[data.count()!=len(data)].tolist()

['Age', 'Cabin', 'Embarked']

In [9]:
pd.DataFrame(data.count()).T

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,891,891,891,891,891,714,891,891,891,891,204,889

In [10]:
data["Age"].iloc[(data["Age"].isnull()).index[data["Age"].isnull()]].head()

5    NaN
17   NaN
19   NaN
26   NaN
28   NaN
Name: Age, dtype: float64

In [11]:
data.fillna(data.mean())["Age"].iloc[17]

29.69911764705882

In [12]:
data.fillna(data.median())["Age"].iloc[28]

28.0

In [13]:
data.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [14]:
data.mode().head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3.0,"Abbing, Mr. Anthony",male,24.0,0.0,0.0,1601,8.05,B96 B98,S
1,2,NaN,NaN,"Abbott, Mr. Rossmore Edward",NaN,NaN,NaN,NaN,347082,NaN,C23 C25 C27,NaN
2,3,NaN,NaN,"Abbott, Mrs. Stanton (Rosa Hunt)",NaN,NaN,NaN,NaN,CA. 2343,NaN,G6,NaN

In [15]:
data.mode().iloc[0].head(3)

PassengerId    1
Survived       0
Pclass         3
Name: 0, dtype: object

In [16]:
data.dtypes.head()

PassengerId     int64
Survived        int64
Pclass          int64
Name           object
Sex            object
dtype: object

In [17]:
(data.dtypes=="object").index[data.dtypes=="object"].tolist()

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [18]:
j = ["apple", "banana"]
print(j)
k = ["apple"]
print(k)
print(set(j).intersection(set(k)))
print(set(j).symmetric_difference(set(k)))

['apple', 'banana']
['apple']
{'apple'}
{'banana'}

In [19]:
objects = (data.dtypes=="object").index[data.dtypes=="object"].tolist()
not_objects = list(set(data.columns.tolist()).symmetric_difference(set(objects)))

data[objects] = data[objects].fillna(data[objects].mode().iloc[0])

data[not_objects] = data[not_objects].fillna(data[not_objects].median())

In [20]:
data.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          891
Embarked       891
dtype: int64

### FINALE - ML

In [38]:
dummies = pd.get_dummies(data[["Embarked","Sex","Pclass"]], columns = ["Embarked","Sex","Pclass"])
dummies.head()

,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Pclass_1,Pclass_2,Pclass_3
0,0,0,1,0,1,0,0,1
1,1,0,0,1,0,1,0,0
2,0,0,1,1,0,0,0,1
3,0,0,1,1,0,1,0,0
4,0,0,1,0,1,0,0,1

In [44]:
not_objects = (data.dtypes!='object').index[data.dtypes!='object'].tolist()
not_objects

['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [46]:
data[not_objects].head()

   PassengerId  Pclass   Age  SibSp  Parch     Fare
0            1       3  22.0      1      0   7.2500
1            2       1  38.0      1      0  71.2833
2            3       3  26.0      0      0   7.9250
3            4       1  35.0      1      0  53.1000
4            5       3  35.0      0      0   8.0500

In [49]:
x = pd.concat([data[not_objects],dummies],1)
x.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S,Sex_female,Sex_male,Pclass_1,Pclass_2,Pclass_3
0,1,3,22.0,1,0,7.2500,0,0,1,0,1,0,0,1
1,2,1,38.0,1,0,71.2833,1,0,0,1,0,1,0,0
2,3,3,26.0,0,0,7.9250,0,0,1,1,0,0,0,1
3,4,1,35.0,1,0,53.1000,0,0,1,1,0,1,0,0
4,5,3,35.0,0,0,8.0500,0,0,1,0,1,0,0,1

In [50]:
from sklearn.model_selection import train_test_split as holdout

try: y = data.pop("Survived")
except: pass

x_train, x_test, y_train, y_test = holdout(x, y, test_size = 0.2, random_state = 1)

In [54]:
from sklearn.preprocessing import RobustScaler as scaler

scaler_model = scaler().fit(x_train)
x_train = scaler_model.transform(x_train)

x_test = scaler_model.transform(x_test)

In [55]:
x_train

array([[-0.32560834,  0.        ,  0.        , ...,  0.        ,
         0.        ,  0.        ],
       [-0.30706837, -2.        ,  0.14285714, ...,  1.        ,
         0.        , -1.        ],
       [ 0.17265353, -1.        ,  0.42857143, ...,  0.        ,
         1.        , -1.        ],
       ...,
       [-0.85631518, -1.        , -0.5       , ...,  0.        ,
         1.        , -1.        ],
       [-0.47856315,  0.        ,  0.        , ...,  0.        ,
         0.        ,  0.        ],
       [-0.93742758,  0.        , -0.5       , ...,  0.        ,
         0.        ,  0.        ]])

In [61]:
from sklearn.linear_model import LinearRegression as lr

model_lr = lr()
model_lr.fit(x_train, y_train)
model_lr.predict(x_train)[0:10]

array([ 0.05516372,  0.99218628,  0.76878925,  0.23105029,  0.10904587,
        0.99123801,  0.34339877,  0.08472611,  1.00842035,  0.17272395])

In [62]:
model_lr.predict(x_test)[0:10]

array([ 0.85844491,  0.05884518,  0.83637207,  0.67631121,  0.94003737,
        0.13061194,  0.23785478,  0.82621082,  0.44062929,  0.59594628])

In [60]:
from sklearn.ensemble import RandomForestClassifier as rfc

model_rfc = rfc()
model_rfc.fit(x_train, y_train)
model_rfc.predict(x_train)[0:10]

array([1, 1, 1, 0, 0, 1, 0, 0, 1, 0], dtype=int64)

In [63]:
model_rfc.predict(x_test)[0:10]

array([1, 0, 1, 1, 1, 0, 0, 1, 0, 1], dtype=int64)